; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star4)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star4)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument11 image1)
	(calibration_target instrument11 Star5)
	(calibration_target instrument11 Star4)
	(supports instrument12 thermograph0)
	(supports instrument12 image1)
	(calibration_target instrument12 GroundStation0)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Phenomenon6)
	(pointing satellite2 Phenomenon7)
	(pointing satellite5 GroundStation2)
	(have_image Phenomenon6 thermograph0)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Planet10 image1)
	(have_image Star11 image1)
	(have_image Phenomenon12 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 11
2. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 1 of 11
3. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 1 of 11
4. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 2 of 11
5. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
6. (take_image satellite0 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 11
7. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 11
8. (take_image satellite0 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 11
9. (turn_to satellite0 phenomenon6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 11
10. (take_image satellite0 phenomenon6 instrument1 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 5 of 11
11. (turn_to satellite0 phenomenon12 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 11
12. (take_image satellite0 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 6 of 11
13. (turn_to satellite0 planet9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet9)
   goals met: 6 of 11
14. (take_image satellite0 planet9 instrument1 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 7 of 11
15. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 7 of 11
16. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 8 of 11
17. (turn_to satellite0 groundstation2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation2)
   goals met: 9 of 11
18. (turn_to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 10 of 11
19. (turn_to satellite2 phenomenon7 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon7)
   goals met: 11 of 11
